# TableCellCalculatedValueData Class

---
The TableCellCalculatedValueData stores the data for calculated value
SystemObject Autodesk.Revit.DBTableCellCalculatedValueData
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class TableCellCalculatedValueData : IDisposable

    Public Class TableCellCalculatedValueData
    	Implements IDisposable

    public ref class TableCellCalculatedValueData : IDisposable

    type TableCellCalculatedValueData =
        class
            interface IDisposable
        end
The TableCellCalculatedValueData type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the TableCellCalculatedValueData
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetName|  Gets the name of the calculated value.
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace